In [1]:
import pandas as pd
import numpy as np

In [8]:
# Dataframe
df=pd.read_csv("EDataset.csv")
print(df)

        Name  Gender EthnicGroup  MathScore  ReadingScore  WritingScore
0     Sushma  female         NaN       71.0          71.0          74.0
1    Binisha  female     group C       69.0          90.0          88.0
2     Sabana  female     group B       87.0          93.0          91.0
3       Amar    male     group A       45.0          56.0          42.0
4     Sanjay    male     group C       76.0          78.0          75.0
5     Asmita  female     group B       73.0          84.0          79.0
6    Kanchan  female     group B        NaN          93.0          89.0
7    Washton    male     group B       41.0          43.0           NaN
8     Yograj    male     group D       65.0          64.0          68.0
9     Ragini  female     group B       37.0          59.0          50.0
10    Naresh    male     group C       58.0           NaN          52.0
11     Arpan    male     group D       40.0          52.0          43.0
12      Sima  female     group B       66.0          82.0          74.0
13     Pawan    male     group A        NaN          73.0          71.0
14     Rinku  female     group A       48.0           NaN          58.0
15    Khushi  female     group C       69.0          75.0          78.0
16     Krish    male     group C       88.0          89.0           NaN
17     Komal  female     group B       18.0          32.0          28.0
18   Aditya     male     group C        NaN          42.0          47.0
19      Rima  female     group C       50.0          56.0          58.0
20     Arbaj    male     group D       66.0           NaN          63.0
21    Amrita  female     group B       65.0          75.0          70.0
22     Bibek    male     group D       42.0          53.0          51.0
23    Arpita  female     group C       66.0          71.0          71.0
24     Arjit    male     group D        NaN          71.0          80.0
25    Manash    male     group A       75.0           NaN          76.0
26  Aashutos    male     group B       66.0          53.0          53.0
27    Anjila  female     group C       69.0          70.0          76.0
28     Waisa    male     group C       70.0          70.0          65.0

In [9]:
# First Step of Inspection
df.head()

      Name  Gender EthnicGroup  MathScore  ReadingScore  WritingScore
0   Sushma  female         NaN       71.0          71.0          74.0
1  Binisha  female     group C       69.0          90.0          88.0
2   Sabana  female     group B       87.0          93.0          91.0
3     Amar    male     group A       45.0          56.0          42.0
4   Sanjay    male     group C       76.0          78.0          75.0

In [10]:
# Second Step of Inspection
df.tail()

        Name  Gender EthnicGroup  MathScore  ReadingScore  WritingScore
24     Arjit    male     group D        NaN          71.0          80.0
25    Manash    male     group A       75.0           NaN          76.0
26  Aashutos    male     group B       66.0          53.0          53.0
27    Anjila  female     group C       69.0          70.0          76.0
28     Waisa    male     group C       70.0          70.0          65.0

In [11]:
# Third Step of Inspection
df.describe()

       MathScore  ReadingScore  WritingScore
count  25.000000      25.00000     27.000000
mean   60.800000      67.80000     65.555556
std    16.653328      16.54791     15.829217
min    18.000000      32.00000     28.000000
25%    48.000000      56.00000     52.500000
50%    66.000000      71.00000     70.000000
75%    70.000000      78.00000     76.000000
max    88.000000      93.00000     91.000000

In [12]:
# Fourth Step of Inspection
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Name          29 non-null     object
 1   Gender        29 non-null     object
 2   EthnicGroup   28 non-null     object
 3   MathScore     25 non-null     float64
 4   ReadingScore  25 non-null     float64
 5   WritingScore  27 non-null     float64
dtypes: float64(3), object(3)
memory usage: 1.5+ KB

In [13]:
# For missing Value
mask=np.random.rand(*df.shape) < 0.1
print(mask)
df[mask]=np.nan

[[False False  True  True  True False]
 [False False False  True  True False]
 [False False False False False False]
 [False False  True False False False]
 [False False False False False False]
 [ True False  True  True False False]
 [ True False False False False False]
 [False False False False False False]
 [False False False False False False]
 [False False False False False False]
 [False False  True False False False]
 [False False False False False False]
 [False False False False False False]
 [False  True False False False False]
 [False False False False False False]
 [False False False False False False]
 [False False False False False False]
 [False False False False False False]
 [False False False False False False]
 [False False False False False False]
 [False False False False False False]
 [False False False False  True False]
 [ True False  True False False  True]
 [False False False False  True False]
 [False False  True False False False]
 [ True False False False False False]
 [False False False False False False]
 [False False  True False False False]
 [False False False False False False]]

In [14]:
print(df)

        Name  Gender EthnicGroup  MathScore  ReadingScore  WritingScore
0     Sushma  female         NaN        NaN           NaN          74.0
1    Binisha  female     group C        NaN           NaN          88.0
2     Sabana  female     group B       87.0          93.0          91.0
3       Amar    male         NaN       45.0          56.0          42.0
4     Sanjay    male     group C       76.0          78.0          75.0
5        NaN  female         NaN        NaN          84.0          79.0
6        NaN  female     group B        NaN          93.0          89.0
7    Washton    male     group B       41.0          43.0           NaN
8     Yograj    male     group D       65.0          64.0          68.0
9     Ragini  female     group B       37.0          59.0          50.0
10    Naresh    male         NaN       58.0           NaN          52.0
11     Arpan    male     group D       40.0          52.0          43.0
12      Sima  female     group B       66.0          82.0          74.0
13     Pawan     NaN     group A        NaN          73.0          71.0
14     Rinku  female     group A       48.0           NaN          58.0
15    Khushi  female     group C       69.0          75.0          78.0
16     Krish    male     group C       88.0          89.0           NaN
17     Komal  female     group B       18.0          32.0          28.0
18   Aditya     male     group C        NaN          42.0          47.0
19      Rima  female     group C       50.0          56.0          58.0
20     Arbaj    male     group D       66.0           NaN          63.0
21    Amrita  female     group B       65.0           NaN          70.0
22       NaN    male         NaN       42.0          53.0           NaN
23    Arpita  female     group C       66.0           NaN          71.0
24     Arjit    male         NaN        NaN          71.0          80.0
25       NaN    male     group A       75.0           NaN          76.0
26  Aashutos    male     group B       66.0          53.0          53.0
27    Anjila  female         NaN       69.0          70.0          76.0
28     Waisa    male     group C       70.0          70.0          65.0

In [15]:
# Checking the missing value if there are any or not.
df.isnull().any()

Name            True
Gender          True
EthnicGroup     True
MathScore       True
ReadingScore    True
WritingScore    True
dtype: bool

In [16]:
# Checking missing value in the column.
df.isnull().sum() # Column wise

Name            4
Gender          1
EthnicGroup     7
MathScore       7
ReadingScore    8
WritingScore    3
dtype: int64

In [17]:
# Counting the number of Missing value on the dataset.
DF=df.isnull().sum().sum() # df entire dataframe sum
print("\n The total number of missing value is: ",DF)

 The total number of missing value is:  30

In [18]:
# For MathScore fill missing values with MEAN
# df["MathScore"] = df["MathScore"].fillna(df["MathScore"].mean())
# For ReadingScore fill missing values with MEAN
# df["ReadingScore"] = df["ReadingScore"].fillna(df["ReadingScore"].mean())
# For WritingScore fill missing values with MEDIAN
# df["WritingScore"] = df["WritingScore"].fillna(df["WritingScore"].median())
# For Gender fill missing values with MODE (most frequent value)
# df["EthicGroup"] = df["EthnicGroup"].fillna(df["EthnicGroup"].mode()[0])
#print(df)

In [19]:
# Data imputation or Handling missing values using fillna
#--> Categorial columns - mode fill ... Numerical columns = mean, median fill
# --> DO NOT USE THIS -->dropna methods to drop rows with at least one empty cell 
# For MathScore for fill missing values with mean
df["MathScore"] = df["MathScore"].fillna(df["MathScore"].mean())
print(df)

        Name  Gender EthnicGroup  MathScore  ReadingScore  WritingScore
0     Sushma  female         NaN  59.409091           NaN          74.0
1    Binisha  female     group C  59.409091           NaN          88.0
2     Sabana  female     group B  87.000000          93.0          91.0
3       Amar    male         NaN  45.000000          56.0          42.0
4     Sanjay    male     group C  76.000000          78.0          75.0
5        NaN  female         NaN  59.409091          84.0          79.0
6        NaN  female     group B  59.409091          93.0          89.0
7    Washton    male     group B  41.000000          43.0           NaN
8     Yograj    male     group D  65.000000          64.0          68.0
9     Ragini  female     group B  37.000000          59.0          50.0
10    Naresh    male         NaN  58.000000           NaN          52.0
11     Arpan    male     group D  40.000000          52.0          43.0
12      Sima  female     group B  66.000000          82.0          74.0
13     Pawan     NaN     group A  59.409091          73.0          71.0
14     Rinku  female     group A  48.000000           NaN          58.0
15    Khushi  female     group C  69.000000          75.0          78.0
16     Krish    male     group C  88.000000          89.0           NaN
17     Komal  female     group B  18.000000          32.0          28.0
18   Aditya     male     group C  59.409091          42.0          47.0
19      Rima  female     group C  50.000000          56.0          58.0
20     Arbaj    male     group D  66.000000           NaN          63.0
21    Amrita  female     group B  65.000000           NaN          70.0
22       NaN    male         NaN  42.000000          53.0           NaN
23    Arpita  female     group C  66.000000           NaN          71.0
24     Arjit    male         NaN  59.409091          71.0          80.0
25       NaN    male     group A  75.000000           NaN          76.0
26  Aashutos    male     group B  66.000000          53.0          53.0
27    Anjila  female         NaN  69.000000          70.0          76.0
28     Waisa    male     group C  70.000000          70.0          65.0

In [20]:
# For ReadingScore for fill missing values with median
df["MathScore"] = df["MathScore"].fillna(df["MathScore"].median())
print(df)

        Name  Gender EthnicGroup  MathScore  ReadingScore  WritingScore
0     Sushma  female         NaN  59.409091           NaN          74.0
1    Binisha  female     group C  59.409091           NaN          88.0
2     Sabana  female     group B  87.000000          93.0          91.0
3       Amar    male         NaN  45.000000          56.0          42.0
4     Sanjay    male     group C  76.000000          78.0          75.0
5        NaN  female         NaN  59.409091          84.0          79.0
6        NaN  female     group B  59.409091          93.0          89.0
7    Washton    male     group B  41.000000          43.0           NaN
8     Yograj    male     group D  65.000000          64.0          68.0
9     Ragini  female     group B  37.000000          59.0          50.0
10    Naresh    male         NaN  58.000000           NaN          52.0
11     Arpan    male     group D  40.000000          52.0          43.0
12      Sima  female     group B  66.000000          82.0          74.0
13     Pawan     NaN     group A  59.409091          73.0          71.0
14     Rinku  female     group A  48.000000           NaN          58.0
15    Khushi  female     group C  69.000000          75.0          78.0
16     Krish    male     group C  88.000000          89.0           NaN
17     Komal  female     group B  18.000000          32.0          28.0
18   Aditya     male     group C  59.409091          42.0          47.0
19      Rima  female     group C  50.000000          56.0          58.0
20     Arbaj    male     group D  66.000000           NaN          63.0
21    Amrita  female     group B  65.000000           NaN          70.0
22       NaN    male         NaN  42.000000          53.0           NaN
23    Arpita  female     group C  66.000000           NaN          71.0
24     Arjit    male         NaN  59.409091          71.0          80.0
25       NaN    male     group A  75.000000           NaN          76.0
26  Aashutos    male     group B  66.000000          53.0          53.0
27    Anjila  female         NaN  69.000000          70.0          76.0
28     Waisa    male     group C  70.000000          70.0          65.0

In [21]:
# For ReadingScore for fill missing values with median
df["ReadingScore"] = df["ReadingScore"].fillna(df["ReadingScore"].median())
print(df)

        Name  Gender EthnicGroup  MathScore  ReadingScore  WritingScore
0     Sushma  female         NaN  59.409091          70.0          74.0
1    Binisha  female     group C  59.409091          70.0          88.0
2     Sabana  female     group B  87.000000          93.0          91.0
3       Amar    male         NaN  45.000000          56.0          42.0
4     Sanjay    male     group C  76.000000          78.0          75.0
5        NaN  female         NaN  59.409091          84.0          79.0
6        NaN  female     group B  59.409091          93.0          89.0
7    Washton    male     group B  41.000000          43.0           NaN
8     Yograj    male     group D  65.000000          64.0          68.0
9     Ragini  female     group B  37.000000          59.0          50.0
10    Naresh    male         NaN  58.000000          70.0          52.0
11     Arpan    male     group D  40.000000          52.0          43.0
12      Sima  female     group B  66.000000          82.0          74.0
13     Pawan     NaN     group A  59.409091          73.0          71.0
14     Rinku  female     group A  48.000000          70.0          58.0
15    Khushi  female     group C  69.000000          75.0          78.0
16     Krish    male     group C  88.000000          89.0           NaN
17     Komal  female     group B  18.000000          32.0          28.0
18   Aditya     male     group C  59.409091          42.0          47.0
19      Rima  female     group C  50.000000          56.0          58.0
20     Arbaj    male     group D  66.000000          70.0          63.0
21    Amrita  female     group B  65.000000          70.0          70.0
22       NaN    male         NaN  42.000000          53.0           NaN
23    Arpita  female     group C  66.000000          70.0          71.0
24     Arjit    male         NaN  59.409091          71.0          80.0
25       NaN    male     group A  75.000000          70.0          76.0
26  Aashutos    male     group B  66.000000          53.0          53.0
27    Anjila  female         NaN  69.000000          70.0          76.0
28     Waisa    male     group C  70.000000          70.0          65.0

In [22]:
# For ReadingScore for fill missing values with mean
df["ReadingScore"] = df["ReadingScore"].fillna(df["ReadingScore"].mean())
print(df)

        Name  Gender EthnicGroup  MathScore  ReadingScore  WritingScore
0     Sushma  female         NaN  59.409091          70.0          74.0
1    Binisha  female     group C  59.409091          70.0          88.0
2     Sabana  female     group B  87.000000          93.0          91.0
3       Amar    male         NaN  45.000000          56.0          42.0
4     Sanjay    male     group C  76.000000          78.0          75.0
5        NaN  female         NaN  59.409091          84.0          79.0
6        NaN  female     group B  59.409091          93.0          89.0
7    Washton    male     group B  41.000000          43.0           NaN
8     Yograj    male     group D  65.000000          64.0          68.0
9     Ragini  female     group B  37.000000          59.0          50.0
10    Naresh    male         NaN  58.000000          70.0          52.0
11     Arpan    male     group D  40.000000          52.0          43.0
12      Sima  female     group B  66.000000          82.0          74.0
13     Pawan     NaN     group A  59.409091          73.0          71.0
14     Rinku  female     group A  48.000000          70.0          58.0
15    Khushi  female     group C  69.000000          75.0          78.0
16     Krish    male     group C  88.000000          89.0           NaN
17     Komal  female     group B  18.000000          32.0          28.0
18   Aditya     male     group C  59.409091          42.0          47.0
19      Rima  female     group C  50.000000          56.0          58.0
20     Arbaj    male     group D  66.000000          70.0          63.0
21    Amrita  female     group B  65.000000          70.0          70.0
22       NaN    male         NaN  42.000000          53.0           NaN
23    Arpita  female     group C  66.000000          70.0          71.0
24     Arjit    male         NaN  59.409091          71.0          80.0
25       NaN    male     group A  75.000000          70.0          76.0
26  Aashutos    male     group B  66.000000          53.0          53.0
27    Anjila  female         NaN  69.000000          70.0          76.0
28     Waisa    male     group C  70.000000          70.0          65.0

In [23]:
print(df["EthnicGroup"].mode())

0    group B
1    group C
Name: EthnicGroup, dtype: object

In [24]:
df["EthnicGroup"] = df["EthnicGroup"].fillna(df["EthnicGroup"].mode()[0])
print(df)

        Name  Gender EthnicGroup  MathScore  ReadingScore  WritingScore
0     Sushma  female     group B  59.409091          70.0          74.0
1    Binisha  female     group C  59.409091          70.0          88.0
2     Sabana  female     group B  87.000000          93.0          91.0
3       Amar    male     group B  45.000000          56.0          42.0
4     Sanjay    male     group C  76.000000          78.0          75.0
5        NaN  female     group B  59.409091          84.0          79.0
6        NaN  female     group B  59.409091          93.0          89.0
7    Washton    male     group B  41.000000          43.0           NaN
8     Yograj    male     group D  65.000000          64.0          68.0
9     Ragini  female     group B  37.000000          59.0          50.0
10    Naresh    male     group B  58.000000          70.0          52.0
11     Arpan    male     group D  40.000000          52.0          43.0
12      Sima  female     group B  66.000000          82.0          74.0
13     Pawan     NaN     group A  59.409091          73.0          71.0
14     Rinku  female     group A  48.000000          70.0          58.0
15    Khushi  female     group C  69.000000          75.0          78.0
16     Krish    male     group C  88.000000          89.0           NaN
17     Komal  female     group B  18.000000          32.0          28.0
18   Aditya     male     group C  59.409091          42.0          47.0
19      Rima  female     group C  50.000000          56.0          58.0
20     Arbaj    male     group D  66.000000          70.0          63.0
21    Amrita  female     group B  65.000000          70.0          70.0
22       NaN    male     group B  42.000000          53.0           NaN
23    Arpita  female     group C  66.000000          70.0          71.0
24     Arjit    male     group B  59.409091          71.0          80.0
25       NaN    male     group A  75.000000          70.0          76.0
26  Aashutos    male     group B  66.000000          53.0          53.0
27    Anjila  female     group B  69.000000          70.0          76.0
28     Waisa    male     group C  70.000000          70.0          65.0

In [25]:
#Choose a filter of your own choice. For eg selecting some rows greater or less than a value
# For MathScore
print(df)
filtered=df[df["MathScore"]>70]
print("\n Filtered row is of MathScore greater than 70. \n ",filtered)

        Name  Gender EthnicGroup  MathScore  ReadingScore  WritingScore
0     Sushma  female     group B  59.409091          70.0          74.0
1    Binisha  female     group C  59.409091          70.0          88.0
2     Sabana  female     group B  87.000000          93.0          91.0
3       Amar    male     group B  45.000000          56.0          42.0
4     Sanjay    male     group C  76.000000          78.0          75.0
5        NaN  female     group B  59.409091          84.0          79.0
6        NaN  female     group B  59.409091          93.0          89.0
7    Washton    male     group B  41.000000          43.0           NaN
8     Yograj    male     group D  65.000000          64.0          68.0
9     Ragini  female     group B  37.000000          59.0          50.0
10    Naresh    male     group B  58.000000          70.0          52.0
11     Arpan    male     group D  40.000000          52.0          43.0
12      Sima  female     group B  66.000000          82.0          74.0
13     Pawan     NaN     group A  59.409091          73.0          71.0
14     Rinku  female     group A  48.000000          70.0          58.0
15    Khushi  female     group C  69.000000          75.0          78.0
16     Krish    male     group C  88.000000          89.0           NaN
17     Komal  female     group B  18.000000          32.0          28.0
18   Aditya     male     group C  59.409091          42.0          47.0
19      Rima  female     group C  50.000000          56.0          58.0
20     Arbaj    male     group D  66.000000          70.0          63.0
21    Amrita  female     group B  65.000000          70.0          70.0
22       NaN    male     group B  42.000000          53.0           NaN
23    Arpita  female     group C  66.000000          70.0          71.0
24     Arjit    male     group B  59.409091          71.0          80.0
25       NaN    male     group A  75.000000          70.0          76.0
26  Aashutos    male     group B  66.000000          53.0          53.0
27    Anjila  female     group B  69.000000          70.0          76.0
28     Waisa    male     group C  70.000000          70.0          65.0

 Filtered row is of MathScore greater than 70.
        Name  Gender EthnicGroup  MathScore  ReadingScore  WritingScore
2   Sabana  female     group B       87.0          93.0          91.0
4   Sanjay    male     group C       76.0          78.0          75.0
16   Krish    male     group C       88.0          89.0           NaN
25     NaN    male     group A       75.0          70.0          76.0

In [26]:
#Selecting a categorical value with some particular objects
filtered=df[df["Gender"]=="male"]
print(filtered)

        Name Gender EthnicGroup  MathScore  ReadingScore  WritingScore
3       Amar   male     group B  45.000000          56.0          42.0
4     Sanjay   male     group C  76.000000          78.0          75.0
7    Washton   male     group B  41.000000          43.0           NaN
8     Yograj   male     group D  65.000000          64.0          68.0
10    Naresh   male     group B  58.000000          70.0          52.0
11     Arpan   male     group D  40.000000          52.0          43.0
16     Krish   male     group C  88.000000          89.0           NaN
18   Aditya    male     group C  59.409091          42.0          47.0
20     Arbaj   male     group D  66.000000          70.0          63.0
22       NaN   male     group B  42.000000          53.0           NaN
24     Arjit   male     group B  59.409091          71.0          80.0
25       NaN   male     group A  75.000000          70.0          76.0
26  Aashutos   male     group B  66.000000          53.0          53.0
28     Waisa   male     group C  70.000000          70.0          65.0

In [27]:
# Use at least one multiple filter
filtered = df[(df["Gender"] == "female") & (df["ReadingScore"] > 60)]
print("\nFemale students with ReadingScore greater than 60:\n", filtered)

# Average of WritingScore
avg = df['WritingScore'].mean()
print("\nAverage of Science column:",avg)
filtered = df[df['WritingScore'] > df["WritingScore"].mean()]
print("\n The row whose value is greater than its average.\n",filtered)

Female students with ReadingScore greater than 60:
        Name  Gender EthnicGroup  MathScore  ReadingScore  WritingScore
0    Sushma  female     group B  59.409091          70.0          74.0
1   Binisha  female     group C  59.409091          70.0          88.0
2    Sabana  female     group B  87.000000          93.0          91.0
5       NaN  female     group B  59.409091          84.0          79.0
6       NaN  female     group B  59.409091          93.0          89.0
12     Sima  female     group B  66.000000          82.0          74.0
14    Rinku  female     group A  48.000000          70.0          58.0
15   Khushi  female     group C  69.000000          75.0          78.0
21   Amrita  female     group B  65.000000          70.0          70.0
23   Arpita  female     group C  66.000000          70.0          71.0
27   Anjila  female     group B  69.000000          70.0          76.0

Average of Science column: 66.11538461538461

 The row whose value is greater than its average.
        Name  Gender EthnicGroup  MathScore  ReadingScore  WritingScore
0    Sushma  female     group B  59.409091          70.0          74.0
1   Binisha  female     group C  59.409091          70.0          88.0
2    Sabana  female     group B  87.000000          93.0          91.0
4    Sanjay    male     group C  76.000000          78.0          75.0
5       NaN  female     group B  59.409091          84.0          79.0
6       NaN  female     group B  59.409091          93.0          89.0
8    Yograj    male     group D  65.000000          64.0          68.0
12     Sima  female     group B  66.000000          82.0          74.0
13    Pawan     NaN     group A  59.409091          73.0          71.0
15   Khushi  female     group C  69.000000          75.0          78.0
21   Amrita  female     group B  65.000000          70.0          70.0
23   Arpita  female     group C  66.000000          70.0          71.0
24    Arjit    male     group B  59.409091          71.0          80.0
25      NaN    male     group A  75.000000          70.0          76.0
27   Anjila  female     group B  69.000000          70.0          76.0

In [28]:
#Advanced data aggregations-->use groupby methods to calculate basic statistics of numerical/categorical columns
                                    # of your own choice based on groups of categorical columns.

In [29]:
# Use groubby Method to calculate basic statistics of numerical/categorical column.

In [30]:
# Groupby
filtered=df.groupby("EthnicGroup")["MathScore"].mean()
print(filtered)

EthnicGroup
group A    60.803030
group B    55.442424
group C    67.227273
group D    57.000000
Name: MathScore, dtype: float64

In [58]:
# Can find the mean of ReadingScore by using groupby by groupping Gender.
filtered=df.groupby("Gender")["ReadingScore"].mean()
print(filtered)

Gender
female    71.000000
male      62.928571
Name: ReadingScore, dtype: float64

In [62]:
# Can you find the maximum values in WritingScore obtained by each gender.
filtered=df.groupby("Gender")["WritingScore"].max()
print(filtered)

Gender
female    91.0
male      80.0
Name: WritingScore, dtype: float64

In [64]:
# Can you find standard deviation of ReadingScore of each gender.
filtered=df.groupby("Gender")["ReadingScore"].std()
print(filtered)

Gender
female    15.615574
male      13.510476
Name: ReadingScore, dtype: float64

In [76]:
# Display the Name of the student who have score hightest in ReadingScore.
# print(df.loc[df["Science"].idmax(),["Name","EthnicGroup"]])
filtered_max=df.loc[df["ReadingScore"]==df["ReadingScore"].max(),["Name","EthnicGroup"]]
print(filtered_max)

     Name EthnicGroup
2  Sabana     group B
6     NaN     group B

In [78]:
# Multiple groupby
filtered=df.groupby(["EthnicGroup","Gender"]).agg({"MathScore":"mean","WritingScore":["mean","max"]})
print(filtered)

                    MathScore WritingScore
                         mean         mean   max
EthnicGroup Gender
group A     female  48.000000    58.000000  58.0
            male    75.000000    76.000000  76.0
group B     female  57.803030    70.111111  91.0
            male    51.901515    56.750000  80.0
group C     female  61.102273    73.750000  88.0
            male    73.352273    62.333333  75.0
group D     male    57.000000    58.000000  68.0